fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщееКоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	ГодДокумента = Параметры.ГодДокумента;
	
	Для Каждого Строка Из Данные Цикл
		НоваяСтрока = ДанныеДиаграммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	Год = ГодДокумента;
	
	ПостроитьДиаграмму(Данные, ГодДокумента);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Уменьшить(Команда)
	
	Данные = ДанныеДиаграммы;
	ГодДокумента = Год;
	
	ПостроитьДиаграмму(Данные, ГодДокумента);
	
	Элементы.ФормаУменьшить.Доступность = Ложь;
	Элементы.ФормаУвеличить.Доступность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Увеличить(Команда)
	
	Данные = ДанныеДиаграммы;
	ГодДокумента = Год;
	
	ПостроитьПодробнуюДиаграмму(Данные, ГодДокумента);
	
	Элементы.ФормаУменьшить.Доступность = Истина;
	Элементы.ФормаУвеличить.Доступность = Ложь;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграмму(Данные, ГодДокумента)
	
	АнализГрафика.Обновление = Ложь;
	АнализГрафика.Очистить();
	АнализГрафика.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	АнализГрафика.АвтоОпределениеПолногоИнтервала = Ложь;
	АнализГрафика.УстановитьПолныйИнтервал(НачалоГода(ГодДокумента), КонецГода(ГодДокумента));
	
	Шкала = АнализГрафика.ОбластьПостроения.ШкалаВремени.Элементы;
	Если Шкала.Количество() > 1 Тогда
		Шкала.Удалить(АнализГрафика.ОбластьПостроения.ШкалаВремени.Элементы[1]);
	КонецЕсли;
		
	Для Каждого Строка Из Данные Цикл
		
		Точка = АнализГрафика.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = АнализГрафика.УстановитьСерию(ГодДокумента);
		Серия.Текст = Формат(ГодДокумента, "ДФ=yyyy;");
		
		Значение = АнализГрафика.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	АнализГрафика.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьПодробнуюДиаграмму(ДанныеДиаграммы, Год)
	
	АнализГрафика.Обновление = Ложь;
	АнализГрафика.Очистить();
	АнализГрафика.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Период;
	
	Шкала = АнализГрафика.ОбластьПостроения.ШкалаВремени.Элементы;
	ШкалаДень = Шкала.Добавить();
	ШкалаДень.Единица = ТипЕдиницыШкалыВремени.День;
	ШкалаДень.ФорматДня = ФорматДняШкалыВремени.ДеньМесяца;
	
	Для Каждого Строка Из ДанныеДиаграммы Цикл
		
		Точка = АнализГрафика.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = АнализГрафика.УстановитьСерию(Год);
		Серия.Текст = Формат(Год, "ДФ=yyyy;");
		
		Значение = АнализГрафика.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	КонецЦикла;
	
	АнализГрафика.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
